# Pandas Basics II

In [2]:
# Pandas Basics
from IPython.display import Image 

from pandas import Series, DataFrame
import pandas as pd
import numpy as np

### 2. Essential functionality
> 핵심 기능 : Series나 DataFrame에 저장된 데이터를 다루는 방법

- Reindexing
- Dropping entries from an axis
- Indexing, selection, and filtering
- Arithmetic and data alignment
- Function application and mapping
- Sorting and ranking

### Reindexing

In [2]:
obj = Series([4.5,7.2,-5.3,3.6], index = ['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [5]:
obj2 = obj.reindex(['a','b','c','d','e'])    # 재정렬!!!!!!!!!!!!!!!!!!!!
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [9]:
obj.reindex(['a','b','c','d','e'], fill_value = 0)    # fill_value : NaN값 대체

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [12]:
# ffill 메소드 : 앞의 값으로 누락된 값을 채워 넣기
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [13]:
obj3.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [14]:
obj3.reindex(range(6), method='ffill')   # 바로 앞의 값으로 누락된값 채워넣음 front fill

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [15]:
obj3.reindex(range(6), method='bfill')   # 바로 뒤의 값으로 누락된값 채워넣음 back fill

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [17]:
frame = DataFrame(np.arange(9).reshape(3,3), index = ['a','c','d'],
                 columns = ['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [18]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [19]:
states = ['Texas','Utah','California']
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [20]:
frame.reindex(index=['a', 'b', 'c', 'd'], columns=states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [21]:
frame.iloc[0:2]

   Ohio  Texas  California
a     0      1           2
c     3      4           5

In [22]:
frame.loc['a':'d']

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

### Dropping entries from an axis
> 하나의 로우 또는 칼럼 삭제하기

- 색인 배열 또는 삭제하려는 로우나 칼럼이 제외된 리스트를 이미 가지고 있다면 쉽게 삭제 가능한데...
- 이 방법은 데이터의 모양을 변경하는 작업이 필요하다.
- drop 메소드를 사용하면 선택한 값이 삭제된 새로운 객체를 얻을 수 있다.
- 칼럼 삭제 : drop( [칼럼명], axis=1)
- 로우 삭제 : drop( [로우명], axis=0) or drop( [로우명] ) </font>

In [23]:
obj = Series(np.arange(5.), index = ['a','b','c','d','e'])
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [24]:
obj.drop(['d','c'])  # 실제 data 삭제는 X

a    0.0
b    1.0
e    4.0
dtype: float64

In [25]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [27]:
data = DataFrame(np.arange(16).reshape(4,4),
                index = ['Ohio','Colorado','Utah','NewYort'],
                columns = ['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NewYort    12   13     14    15

In [28]:
data.drop(['Colorado','Ohio'])

         one  two  three  four
Utah       8    9     10    11
NewYort   12   13     14    15

### [Note] axis=1 denotes that we are referring to a column, not a row

In [29]:
data.drop('two',axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
NewYort    12     14    15

In [30]:
data.drop(columns = 'two')

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
NewYort    12     14    15

In [31]:
data.drop(['two','four'], axis = 1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
NewYort    12     14

In [33]:
# data.drop(columns = 'two','four')

SyntaxError: positional argument follows keyword argument (1091141525.py, line 1)

In [38]:
# ?data.drop

### Indexing, selection, and filtering
> 색인하기, 선택하기, 거르기

- Series의 색인(obj[...])은 NumPy 배열의 색인과 유사하게 동작하는데,
- Series의 색인은 정수가 아니어도 된다는 점이 다르다.
- 또한 라벨이름으로 슬라이싱하는 것은 시작점과 끝점을 포함한다는 것이 파이썬과 다른점이다.

In [41]:
obj= Series(np.arange(4.), index = ['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [42]:
obj['b']

1.0

In [43]:
obj[1]

1.0

In [44]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [45]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [47]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [48]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

### 라벨이름으로 슬라이싱 할 경우, 끝점도 포함한다.

In [50]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [51]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [3]:
np.arange(16).reshape((4, 4))

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [52]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [53]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [54]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [55]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [56]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [57]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [58]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [60]:
data.loc['Colorado', ['two','three']]   # 특정 index / coulumn 값 불러오기!!!!!!!!!!!!!!!!!!!!!!!

two      5
three    6
Name: Colorado, dtype: int32

In [61]:
data.loc['New York','one']

12

In [62]:
data.loc['New York', ['one','two','three']]

one      12
two      13
three    14
Name: New York, dtype: int32

### Arithmetic and data alignment
>산술연산과 데이터 정렬

- pandas 에서 중요한 기능은 색인이 다른 객체 간의 산술연산이다.
- 객체를 더할 때 짝이 맞지 않는 색인이 있다면 결과에 두 색인이 통합된다.